Documents/Рекламация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>Рекламация</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Рекламация/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// прямые
	Проводки = Движения.ВнутренниеВзаиморасчеты.ДобавитьРасход();
	Проводки.Период = Дата;
	Проводки.Подразделение1 = Подразделение;
	Проводки.Подразделение2 = ПодразделениеПолучатель;
	Проводки.Сумма = Сумма;
	
	// обратные
	Проводки = Движения.ВнутренниеВзаиморасчеты.ДобавитьПриход();
	Проводки.Период = Дата;
	Проводки.Подразделение1 = ПодразделениеПолучатель;
	Проводки.Подразделение2 = Подразделение;
	Проводки.Сумма = Сумма;
	
	// оборотка
	Проводки = Движения.ОборотыПоСтатьям.Добавить();
	Проводки.Период = Дата;
	Проводки.Подразделение = Подразделение;
	Проводки.Статья = Справочники.Статьи.РекламацияРасход;
	Проводки.Факт = Сумма;
	
	Проводки = Движения.ОборотыПоСтатьям.Добавить();
	Проводки.Период = Дата;
	Проводки.Подразделение = ПодразделениеПолучатель;
	Проводки.Статья = Справочники.Статьи.РекламацияДоход;
	Проводки.Факт = Сумма;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Подразделение = ПодразделениеПолучатель Тогда
		
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Нельзя выставить рекламацию самому себе";
		Сообщение.Поле = "ПодразделениеПолучатель";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры
